# Dealing with missing data

In [3]:
import pandas as pd
import numpy as np

In [5]:
from numpy import NaN

In [7]:
data1 = {'Name':['person1', 'person2', 'person3', 'person4'], 
         'Age':[28, 27, NaN, 36]}

In [9]:
data = pd.DataFrame(data1)
data

      Name   Age
0  person1  28.0
1  person2  27.0
2  person3   NaN
3  person4  36.0

In [11]:
data.isnull()

    Name    Age
0  False  False
1  False  False
2  False   True
3  False  False

In [13]:
data.isnull().sum()

Name    0
Age     1
dtype: int64

to remove the rows have null values

In [16]:
data.dropna()
# data.dropna(inplace = True)

      Name   Age
0  person1  28.0
1  person2  27.0
3  person4  36.0

In [18]:
data['Age'].dtype

dtype('float64')

In [20]:
data2 = {'Name':['person1', 'person2', 'person3', 'person4'], 
         'Age':[28, 27, 45, 36]}

In [22]:
df = pd.DataFrame(data2)
df

      Name  Age
0  person1   28
1  person2   27
2  person3   45
3  person4   36

In [28]:
df['Age'].dtype

dtype('int64')

In [24]:
data

      Name   Age
0  person1  28.0
1  person2  27.0
2  person3   NaN
3  person4  36.0

# filling missing values with mean/ median/ mode

In [ ]:
data['Age'].fillna(data['Age'].mean())

# data['Age'].fillna(data['Age'].mean(), inplace = True)

In [36]:
data2 = {'Name':['person1', 'person2', 'person3', 'person4', 'Person5'], 
         'Age':[28, 27, NaN, 28, 27]}

In [38]:
df = pd.DataFrame(data2)
df

      Name   Age
0  person1  28.0
1  person2  27.0
2  person3   NaN
3  person4  28.0
4  Person5  27.0

In [46]:
df['Age'].mode()[0]

27.0

In [42]:
data

      Name   Age
0  person1  28.0
1  person2  27.0
2  person3   NaN
3  person4  36.0

In [40]:
data['Age'].mode()

0    27.0
1    28.0
2    36.0
Name: Age, dtype: float64

In [50]:
df['Age'].fillna(df['Age'].mode()[0])

# df['Age'].fillna(df['Age'].mode()[0] inplace=True)

0    28.0
1    27.0
2    27.0
3    28.0
4    27.0
Name: Age, dtype: float64

In [ ]:
# using median

df['Age'].fillna(df['Age'].median())